{
  "fileName": "Circular 28.pdf",
  "processedAt": "2025-04-22T22:03:05.660Z",
  "finalSummary": "The Financial Services Board (FSB) of South Africa issued Information Circular No. 28 on 24 October 2016, which formally withdrew the earlier Circular No. 27 dated 29 April 2016. Circular No. 27 had introduced requirements for reporting on Key Audit Matters (KAM) in relation to collective investment schemes. However, following concerns and feedback from industry stakeholders questioning the appropriateness and applicability of these KAM reporting obligations, the FSB decided to withdraw Circular No. 27 entirely with Circular No. 28.\n\nThis withdrawal effectively removed the obligation for managers of collective investment schemes to report on Key Audit Matters as previously mandated by Circular No. 27[5]. The decision was driven by stakeholder input indicating that the KAM reporting requirements were not suitable or practical in this context.\n\nIn summary:\n\n- The FSB initially issued Circular No. 27 in April 2016 requiring KAM reporting for collective investment schemes.\n- Industry concerns about these requirements led to a reconsideration.\n- On 24 October 2016, through Information Circular No.28, the FSB withdrew Circular No.27.\n- This withdrawal eliminated managers' obligation to report on Key Audit Matters under tha In summary:\n\n- The Financial Services Board (FSB) initially issued Circular No. 27 in April 2016, requiring managers of collective investment schemes to report on Key Audit Matters (KAM).\n- Industry stakeholders raised concerns about the appropriateness and practicality of these KAM reporting requirements.\n- On 24 October 2016, the FSB issued Information Circular No. 28, which formally withdrew Circular No. 27.\n- This withdrawal effectively removed the obligation for managers of collective investment schemes to report on Key Audit Matters, as previously mandated by Circular No. 27. The decision was driven by stakeholder feedback indicating that the KAM reporting requirements were not suitable or practical in this context.",
  "chunkSummaries": [
    "The document is an **information circular (No. 28)** issued by South Africa's **Financial Services Board (FSB)** on **24 October 2016**, formally withdrawing **Circular No. 27** (issued on 29 April 2016) related to **Key Audit Matters (KAM)** for collective investment schemes. The withdrawal followed industry concerns about the appropriateness of KAM reporting requirements, eliminating the obligation for managers to report on these matters[5].  \n\n**Core content**:  \n- **Purpose**: Withdrawal of Circular No. 27 due to stakeholder feedback questioning its appli"
  ]
}